#+TITLE: CSS!
#+REVEAL_ROOT: ./vendor/reveal.js


* COMMENT scripts
#+begin_src emacs-lisp
  (setq org-html-klipse-selection-script
  "window.klipse_settings = {selector_eval_html: '.src-html',
                               selector_eval_js: '.src-js',
                               selector_eval_python_client: '.src-python',
                               selector_eval_scheme: '.src-scheme',
                               selector: '.src-clojure',
                               selector_eval_ruby: '.src-ruby',
                               codemirror_options_in: {
                                   indentUnit: 8,
                                   lineWrapping: true,
                                   lineNumbers: true,
                                   autoCloseBrackets: true
                                   },
                               codemirror_options_out: {
                                   lineWrapping: true,
                                   lineNumbers: true
      }};")

 ;; (require 'org-tempo)


#+end_src

#+RESULTS:
#+begin_example
window.klipse_settings = {selector_eval_html: '.src-html',
                              selector_eval_js: '.src-js',
                              selector_eval_python_client: '.src-python',
                              selector_eval_scheme: '.src-scheme',
                              selector: '.src-clojure',
                              selector_eval_ruby: '.src-ruby',
                              codemirror_options_in: {
                                  indentUnit: 8,
                                  lineWrapping: true,
                                  lineNumbers: true,
                                  autoCloseBrackets: true
                                  },
                              codemirror_options_out: {
                                  lineWrapping: true,
                                  lineNumbers: true
     }};
#+end_example


